of70/tutorials/rheoHeatFoam/channel/PTTLog/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0.01;
        minIter          0;
        maxIter          800;
        
    }

    "(theta|tau|T|U)"
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-8;
        relTol            0.;
        minIter           0;
        maxIter           1000;
    }
 
}

 

SIMPLE
{
    solveFluid      true;
    
    nInIter         1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        
    }
}

relaxationFactors
{
    
}

// ************************************************************************* //
